In [92]:
import pandas as pd

In [93]:
df = pd.read_csv("https://raw.githubusercontent.com/Apress/data-analysis-and-visualization-using-python/master/Ch07/Salaries.csv")

In [94]:
type(df)

pandas.core.frame.DataFrame

In [95]:
df.head(10)

        rank discipline  phd  service   sex  salary
0       Prof          B   56       49  Male  186960
1       Prof          A   12        6  Male   93000
2       Prof          A   23       20  Male  110515
3       Prof          A   40       31  Male  131205
4       Prof          B   20       18  Male  104800
5       Prof          A   20       20  Male  122400
6  AssocProf          A   20       17  Male   81285
7       Prof          A   18       18  Male  126300
8       Prof          A   29       19  Male   94350
9       Prof          A   51       51  Male   57800

In [96]:
df.columns

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [97]:
df.shape

(78, 6)

In [98]:
df.dtypes

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [99]:
df.tail(10)

         rank discipline  phd  service     sex  salary
68   AsstProf          A    4        2  Female   77500
69       Prof          A   28        7  Female  116450
70   AsstProf          A    8        3  Female   78500
71  AssocProf          B   12        9  Female   71065
72       Prof          B   24       15  Female  161101
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

In [100]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 78 entries, 0 to 77
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   rank        78 non-null     object
 1   discipline  78 non-null     object
 2   phd         78 non-null     int64
 3   service     78 non-null     int64
 4   sex         78 non-null     object
 5   salary      78 non-null     int64
dtypes: int64(3), object(3)
memory usage: 3.8+ KB

In [101]:
df.describe()

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [102]:
df.dtypes  
df

         rank discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[78 rows x 6 columns]

In [103]:
df['sex'] = df['sex'].map({'Male': 1, 'Female': 0}) 
df

         rank discipline  phd  service  sex  salary
0        Prof          B   56       49    1  186960
1        Prof          A   12        6    1   93000
2        Prof          A   23       20    1  110515
3        Prof          A   40       31    1  131205
4        Prof          B   20       18    1  104800
..        ...        ...  ...      ...  ...     ...
73       Prof          B   18       10    0  105450
74  AssocProf          B   19        6    0  104542
75       Prof          B   17       17    0  124312
76       Prof          A   28       14    0  109954
77       Prof          A   23       15    0  109646

[78 rows x 6 columns]

In [104]:
df.describe()

             phd    service        sex         salary
count  78.000000  78.000000  78.000000      78.000000
mean   19.705128  15.051282   0.500000  108023.782051
std    12.498425  12.139768   0.503236   28293.661022
min     1.000000   0.000000   0.000000   57800.000000
25%    10.250000   5.250000   0.000000   88612.500000
50%    18.500000  14.500000   0.500000  104671.000000
75%    27.750000  20.750000   1.000000  126774.750000
max    56.000000  51.000000   1.000000  186960.000000

In [105]:
df.max()

rank            Prof
discipline         B
phd               56
service           51
sex                1
salary        186960
dtype: object

In [106]:
df.min()

rank          AssocProf
discipline            A
phd                   1
service               0
sex                   0
salary            57800
dtype: object

In [107]:
df.mean()

phd            19.705128
service        15.051282
sex             0.500000
salary     108023.782051
dtype: float64

In [108]:
df.discipline.value_counts()

B    42
A    36
Name: discipline, dtype: int64

In [109]:
df.sex.value_counts()

1    39
0    39
Name: sex, dtype: int64

In [110]:
df['rank'].dtype   
df.dtypes

rank          object
discipline    object
phd            int64
service        int64
sex            int64
salary         int64
dtype: object

In [111]:
df["rank"].value_counts()

Prof         46
AsstProf     19
AssocProf    13
Name: rank, dtype: int64

In [112]:
df.describe()

             phd    service        sex         salary
count  78.000000  78.000000  78.000000      78.000000
mean   19.705128  15.051282   0.500000  108023.782051
std    12.498425  12.139768   0.503236   28293.661022
min     1.000000   0.000000   0.000000   57800.000000
25%    10.250000   5.250000   0.000000   88612.500000
50%    18.500000  14.500000   0.500000  104671.000000
75%    27.750000  20.750000   1.000000  126774.750000
max    56.000000  51.000000   1.000000  186960.000000

In [113]:
df.std()

phd           12.498425
service       12.139768
sex            0.503236
salary     28293.661022
dtype: float64

In [114]:
df_50=df.head(50)

In [115]:
df_50.mean()

phd            21.52
service        17.60
sex             0.78
salary     113789.14
dtype: float64

In [116]:
df.head(50).mean()

phd            21.52
service        17.60
sex             0.78
salary     113789.14
dtype: float64

In [117]:
#Selecting a column
df.salary

0     186960
1      93000
2     110515
3     131205
4     104800
       ...
73    105450
74    104542
75    124312
76    109954
77    109646
Name: salary, Length: 78, dtype: int64

In [118]:
df['salary']

0     186960
1      93000
2     110515
3     131205
4     104800
       ...
73    105450
74    104542
75    124312
76    109954
77    109646
Name: salary, Length: 78, dtype: int64

In [119]:
df[['salary']]

    salary
0   186960
1    93000
2   110515
3   131205
4   104800
..     ...
73  105450
74  104542
75  124312
76  109954
77  109646

[78 rows x 1 columns]

In [120]:
df.columns

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

Calculate the basic statistics for the Phd column;

Find how many values in the Phd column (use count method);

Calculate the average Phd;

In [121]:
df.phd.describe()

count    78.000000
mean     19.705128
std      12.498425
min       1.000000
25%      10.250000
50%      18.500000
75%      27.750000
max      56.000000
Name: phd, dtype: float64

In [122]:
df.phd.count()

78

In [123]:
df.phd.mean()

19.705128205128204

In [124]:
df.groupby(['rank']).mean()

                 phd    service       sex         salary
rank
AssocProf  15.076923  11.307692  0.230769   91786.230769
AsstProf    5.052632   2.210526  0.421053   81362.789474
Prof       27.065217  21.413043  0.608696  123624.804348

In [125]:
df.groupby('rank')[['salary','phd']].mean()

                  salary        phd
rank
AssocProf   91786.230769  15.076923
AsstProf    81362.789474   5.052632
Prof       123624.804348  27.065217

In [126]:
grouped=df.groupby('rank')

In [127]:
type(grouped)

pandas.core.groupby.generic.DataFrameGroupBy

In [128]:
df[df.salary>120000]

    rank discipline  phd  service  sex  salary
0   Prof          B   56       49    1  186960
3   Prof          A   40       31    1  131205
5   Prof          A   20       20    1  122400
7   Prof          A   18       18    1  126300
10  Prof          B   39       33    1  128250
11  Prof          B   23       23    1  134778
13  Prof          B   35       33    1  162200
14  Prof          B   25       19    1  153750
15  Prof          B   17        3    1  150480
19  Prof          A   29       27    1  150500
26  Prof          A   38       19    1  148750
27  Prof          A   45       43    1  155865
29  Prof          B   21       20    1  123683
31  Prof          B   22       21    1  155750
35  Prof          B   28       23    1  126933
36  Prof          B   45       45    1  146856
39  Prof          B   18       18    0  129000
40  Prof          A   39       36    0  137000
44  Prof          B   23       19    0  151768
45  Prof          B   25       25    0  140096
49  Prof          B   17       18    0  122960
51  Prof          B   20       14    0  127512
58  Prof          B   36       26    0  144651
72  Prof          B   24       15    0  161101
75  Prof          B   17       17    0  124312

In [129]:
df

         rank discipline  phd  service  sex  salary
0        Prof          B   56       49    1  186960
1        Prof          A   12        6    1   93000
2        Prof          A   23       20    1  110515
3        Prof          A   40       31    1  131205
4        Prof          B   20       18    1  104800
..        ...        ...  ...      ...  ...     ...
73       Prof          B   18       10    0  105450
74  AssocProf          B   19        6    0  104542
75       Prof          B   17       17    0  124312
76       Prof          A   28       14    0  109954
77       Prof          A   23       15    0  109646

[78 rows x 6 columns]

In [130]:
df.head()

   rank discipline  phd  service  sex  salary
0  Prof          B   56       49    1  186960
1  Prof          A   12        6    1   93000
2  Prof          A   23       20    1  110515
3  Prof          A   40       31    1  131205
4  Prof          B   20       18    1  104800

In [131]:
df.iloc[1:4, 0:3]

   rank discipline  phd
1  Prof          A   12
2  Prof          A   23
3  Prof          A   40

In [132]:
df.iloc[0:10,0:3]

        rank discipline  phd
0       Prof          B   56
1       Prof          A   12
2       Prof          A   23
3       Prof          A   40
4       Prof          B   20
5       Prof          A   20
6  AssocProf          A   20
7       Prof          A   18
8       Prof          A   29
9       Prof          A   51

In [133]:
df.iloc[0:2,]

   rank discipline  phd  service  sex  salary
0  Prof          B   56       49    1  186960
1  Prof          A   12        6    1   93000

In [134]:
df.iloc[:,4]

0     1
1     1
2     1
3     1
4     1
     ..
73    0
74    0
75    0
76    0
77    0
Name: sex, Length: 78, dtype: int64